_src/wiki/2016-06-13-python-pymysql.org
# -*- coding: utf-8-unix; -*-
#+TITLE:       Python PyMySQLdb
#+AUTHOR:      Bruce Asu
#+EMAIL:       bruceasu@163.com
#+DATE:        <2016-06-13 20:48>
#+filetags:    python
#+LANGUAGE:    en
#+OPTIONS:     H:7 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil


