wiki/2016-06-13-python-pymysql.html
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge511257">PYMYSQL.PY</a></li>
<li><a href="#org0d80d30">测试代码：</a></li>
<li><a href="#orgcc7c676">测试输出：</a></li>
</ul>
</div>
</nav>


<div id="outline-container-orge511257" class="outline-2">
<h2 id="orge511257">PYMYSQL.PY</h2>
<div class="outline-text-2" id="text-orge511257">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">-*- encoding:utf-8 -*-_</span>
<span style="font-style: italic;">'''</span>
<span style="font-style: italic;">Created on 2012-1-12</span>
<span style="font-style: italic;">@author: xiaojay</span>
<span style="font-style: italic;">'''</span>
<span style="font-weight: bold;">import</span> MySQLdb
<span style="font-weight: bold;">import</span> MySQLdb.cursors

<span style="font-weight: bold; font-style: italic;">STORE_RESULT_MODE</span> = 0
<span style="font-weight: bold; font-style: italic;">USE_RESULT_MODE</span> = 1

<span style="font-weight: bold; font-style: italic;">CURSOR_MODE</span> = 0
<span style="font-weight: bold; font-style: italic;">DICTCURSOR_MODE</span> = 1
<span style="font-weight: bold; font-style: italic;">SSCURSOR_MODE</span> = 2
<span style="font-weight: bold; font-style: italic;">SSDICTCURSOR_MODE</span> = 3

<span style="font-weight: bold; font-style: italic;">FETCH_ONE</span> = 0
<span style="font-weight: bold; font-style: italic;">FETCH_MANY</span> = 1
<span style="font-weight: bold; font-style: italic;">FETCH_ALL</span> = 2

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">PyMysql</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">self</span>.conn = <span style="font-weight: bold; text-decoration: underline;">None</span>
        <span style="font-weight: bold;">pass</span>

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">newConnection</span>(<span style="font-weight: bold;">self</span>,host,user,passwd,defaultdb):
         <span style="font-style: italic;">"""</span>
<span style="font-style: italic;">          &#24314;&#31435;&#19968;&#20010;&#26032;&#36830;&#25509;&#65292;&#25351;&#23450;host&#12289;&#29992;&#25143;&#21517;&#12289;&#23494;&#30721;&#12289;&#40664;&#35748;&#25968;&#25454;&#24211;</span>
<span style="font-style: italic;">          """</span>
         <span style="font-weight: bold;">self</span>.conn = MySQLdb.Connect(host,user,passwd,defaultdb)
         <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.conn.<span style="font-weight: bold;">open</span> == <span style="font-weight: bold; text-decoration: underline;">False</span>:
             <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">None</span>

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">closeConnnection</span>(<span style="font-weight: bold;">self</span>):
         <span style="font-style: italic;">"""</span>
<span style="font-style: italic;">          &#20851;&#38381;&#24403;&#21069;&#36830;&#25509;</span>
<span style="font-style: italic;">          """</span>
         <span style="font-weight: bold;">self</span>.conn.close()

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">query</span>(<span style="font-weight: bold;">self</span>,sqltext,mode=STORE_RESULT_MODE):
         <span style="font-style: italic;">"""</span>
<span style="font-style: italic;">          &#20316;&#29992;&#65306;&#20351;&#29992;connection&#23545;&#35937;&#30340;query&#26041;&#27861;&#65292;&#24182;&#36820;&#22238;&#19968;&#20010;&#20803;&#32452;(&#24433;&#21709;&#34892;&#25968;(int),&#32467;&#26524;&#38598;(result))</span>
<span style="font-style: italic;">          &#21442;&#25968;&#65306;sqltext&#65306;sql&#35821;&#21477;</span>
<span style="font-style: italic;">               mode=STORE_RESULT_MODE&#65288;0&#65289; &#34920;&#31034;&#36820;&#22238;store_result&#65292;mode=USESTORE_RESULT_MODE&#65288;1&#65289; &#34920;&#31034;&#36820;&#22238;use_result</span>
<span style="font-style: italic;">          &#36820;&#22238;&#65306;&#20803;&#32452;(&#24433;&#21709;&#34892;&#25968;(int),&#32467;&#26524;&#38598;(result)</span>
<span style="font-style: italic;">          """</span>
         <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.conn==<span style="font-weight: bold; text-decoration: underline;">None</span> <span style="font-weight: bold;">or</span> <span style="font-weight: bold;">self</span>.conn.<span style="font-weight: bold;">open</span>==<span style="font-weight: bold; text-decoration: underline;">False</span> :
             <span style="font-weight: bold;">return</span> -1
         <span style="font-weight: bold;">self</span>.conn.query(sqltext)
         <span style="font-weight: bold;">if</span> mode == 0 :
             <span style="font-weight: bold; font-style: italic;">result</span> = <span style="font-weight: bold;">self</span>.conn.store_result()
         <span style="font-weight: bold;">elif</span> mode == 1 :
             <span style="font-weight: bold; font-style: italic;">result</span> = <span style="font-weight: bold;">self</span>.conn.use_result()
         <span style="font-weight: bold;">else</span> :
             <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">Exception</span>(<span style="font-style: italic;">"mode value is wrong."</span>)
         <span style="font-weight: bold;">return</span> (<span style="font-weight: bold;">self</span>.conn.affected_rows(),result)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">fetch_queryresult</span>(<span style="font-weight: bold;">self</span>,result,maxrows=1,how=0,moreinfo=<span style="font-weight: bold; text-decoration: underline;">False</span>):
         <span style="font-style: italic;">"""</span>
<span style="font-style: italic;">          &#21442;&#25968;:result&#65306; query&#21518;&#30340;&#32467;&#26524;&#38598;&#21512;</span>
<span style="font-style: italic;">              maxrows&#65306; &#36820;&#22238;&#30340;&#26368;&#22823;&#34892;&#25968;</span>
<span style="font-style: italic;">              how&#65306; &#20197;&#20309;&#31181;&#26041;&#24335;&#23384;&#20648;&#32467;&#26524;</span>
<span style="font-style: italic;">               (0&#65306;tuple,1&#65306;dictionaries with columnname,2&#65306;dictionaries with table.columnname)</span>
<span style="font-style: italic;">              moreinfo &#34920;&#31034;&#26159;&#21542;&#33719;&#21462;&#26356;&#22810;&#39069;&#22806;&#20449;&#24687;&#65288;num_fields&#65292;num_rows,num_fields&#65289;</span>
<span style="font-style: italic;">          &#36820;&#22238;&#65306;&#20803;&#32452;&#65288;&#25968;&#25454;&#38598;&#65292;&#38468;&#21152;&#20449;&#24687;&#65288;&#24403;moreinfo=False&#65289;&#25110;&#21333;&#19968;&#25968;&#25454;&#38598;&#65288;&#24403;moreinfo=True&#65289;</span>
<span style="font-style: italic;">          """</span>
         <span style="font-weight: bold;">if</span> result == <span style="font-weight: bold; text-decoration: underline;">None</span> : <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">None</span>
         <span style="font-weight: bold; font-style: italic;">dataset</span> =  result.fetch_row(maxrows,how)
         <span style="font-weight: bold;">if</span> moreinfo <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">False</span> :
             <span style="font-weight: bold;">return</span> dataset
         <span style="font-weight: bold;">else</span>:
             <span style="font-weight: bold; font-style: italic;">num_fields</span> = result.num_fields()
             <span style="font-weight: bold; font-style: italic;">num_rows</span> = result.num_rows()
             <span style="font-weight: bold; font-style: italic;">field_flags</span> = result.field_flags()
             <span style="font-weight: bold; font-style: italic;">info</span> = (num_fields,num_rows,field_flags)
             <span style="font-weight: bold;">return</span> (dataset,info)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">execute</span>(<span style="font-weight: bold;">self</span>,sqltext,args=<span style="font-weight: bold; text-decoration: underline;">None</span>,mode=CURSOR_MODE,many=<span style="font-weight: bold; text-decoration: underline;">False</span>):
         <span style="font-style: italic;">"""</span>
<span style="font-style: italic;">          &#20316;&#29992;&#65306;&#20351;&#29992;&#28216;&#26631;&#65288;cursor&#65289;&#30340;execute &#25191;&#34892;query</span>
<span style="font-style: italic;">          &#21442;&#25968;&#65306;sqltext&#65306; &#34920;&#31034;sql&#35821;&#21477;</span>
<span style="font-style: italic;">               args&#65306; sqltext&#30340;&#21442;&#25968;</span>
<span style="font-style: italic;">               mode&#65306;&#20197;&#20309;&#31181;&#26041;&#24335;&#36820;&#22238;&#25968;&#25454;&#38598;</span>
<span style="font-style: italic;">                  CURSOR_MODE = 0 &#65306;use_result , tuple</span>
<span style="font-style: italic;">                  DICTCURSOR_MODE = 1 &#65306;  use_result, dict</span>
<span style="font-style: italic;">                  SSCURSOR_MODE = 2 :  store_result, tuple</span>
<span style="font-style: italic;">                  SSDICTCURSOR_MODE = 3 : store_result , dict</span>
<span style="font-style: italic;">               many&#65306;&#26159;&#21542;&#25191;&#34892;&#22810;&#34892;&#25805;&#20316;&#65288;executemany&#65289;</span>
<span style="font-style: italic;">          &#36820;&#22238;&#65306;&#20803;&#32452;&#65288;&#24433;&#21709;&#34892;&#25968;&#65288;int&#65289;&#65292;&#28216;&#26631;&#65288;Cursor&#65289;&#65289;</span>
<span style="font-style: italic;">          """</span>
         <span style="font-weight: bold;">if</span> mode == CURSOR_MODE :
             <span style="font-weight: bold; font-style: italic;">curclass</span> = MySQLdb.cursors.Cursor
         <span style="font-weight: bold;">elif</span> mode == DICTCURSOR_MODE :
             <span style="font-weight: bold; font-style: italic;">curclass</span> = MySQLdb.cursors.DictCursor
         <span style="font-weight: bold;">elif</span> mode == SSCURSOR_MODE :
             <span style="font-weight: bold; font-style: italic;">curclass</span> = MySQLdb.cursors.SSCursor
         <span style="font-weight: bold;">elif</span> mode == SSDICTCURSOR_MODE :
             <span style="font-weight: bold; font-style: italic;">curclass</span> = MySQLdb.cursors.SSDictCursor
         <span style="font-weight: bold;">else</span> :
             <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">Exception</span>(<span style="font-style: italic;">"mode value is wrong"</span>)

         <span style="font-weight: bold; font-style: italic;">cur</span> = <span style="font-weight: bold;">self</span>.conn.cursor(cursorclass=curclass)
         <span style="font-weight: bold; font-style: italic;">line</span> = 0
         <span style="font-weight: bold;">if</span> many == <span style="font-weight: bold; text-decoration: underline;">False</span> :
             <span style="font-weight: bold;">if</span> args == <span style="font-weight: bold; text-decoration: underline;">None</span> :
                 <span style="font-weight: bold; font-style: italic;">line</span> = cur.execute(sqltext)
             <span style="font-weight: bold;">else</span> :
                 <span style="font-weight: bold; font-style: italic;">line</span> = cur.execute(sqltext,args)
         <span style="font-weight: bold;">else</span>:
             <span style="font-weight: bold;">if</span> args == <span style="font-weight: bold; text-decoration: underline;">None</span> :
                 <span style="font-weight: bold; font-style: italic;">line</span> = cur.executemany(sqltext)
             <span style="font-weight: bold;">else</span> :
                 <span style="font-weight: bold; font-style: italic;">line</span> = cur.executemany(sqltext,args)
         <span style="font-weight: bold;">return</span> (line , cur )

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">fetch_executeresult</span>(<span style="font-weight: bold;">self</span>,cursor,mode=FETCH_ONE,rows=1):
         <span style="font-style: italic;">"""</span>
<span style="font-style: italic;">          &#20316;&#29992;&#65306;&#25552;&#21462;cursor&#33719;&#21462;&#30340;&#25968;&#25454;&#38598;</span>
<span style="font-style: italic;">          &#21442;&#25968;&#65306;cursor&#65306;&#28216;&#26631;</span>
<span style="font-style: italic;">               mode&#65306;&#25191;&#34892;&#25552;&#21462;&#27169;&#24335;</span>
<span style="font-style: italic;">                FETCH_ONE: &#25552;&#21462;&#19968;&#20010;&#65307; FETCH_MANY :&#25552;&#21462;rows&#20010; &#65307;FETCH_ALL : &#25552;&#21462;&#25152;&#26377;</span>
<span style="font-style: italic;">               rows&#65306;&#25552;&#21462;&#34892;&#25968;</span>
<span style="font-style: italic;">          &#36820;&#22238;&#65306;fetch&#25968;&#25454;&#38598;</span>
<span style="font-style: italic;">          """</span>
         <span style="font-weight: bold;">if</span> cursor == <span style="font-weight: bold; text-decoration: underline;">None</span> :
             <span style="font-weight: bold;">return</span>
         <span style="font-weight: bold;">if</span> mode == FETCH_ONE :
             <span style="font-weight: bold;">return</span> cursor.fetchone()
         <span style="font-weight: bold;">elif</span> mode == FETCH_MANY :
             <span style="font-weight: bold;">return</span> cursor.fetchmany(rows)
         <span style="font-weight: bold;">elif</span> mode == FETCH_ALL :
             <span style="font-weight: bold;">return</span> cursor.fetchall()


<span style="font-weight: bold;">if</span> <span style="font-weight: bold;">__name__</span>==<span style="font-style: italic;">"__main__"</span> :
    <span style="font-weight: bold;">print</span> <span style="font-weight: bold;">help</span> (PyMysql)

</pre>
</div>
</div>
</div>
