_src/wiki/2016-06-13-python-pymysql.org
* 测试代码：
#+BEGIN_SRC python
#-*- encoding:utf-8 -*-
import PyMysql

"""
authors 这张表很简单。
+--------------+-------------+------+-----+---------+----------------+
| Field        | Type        | Null | Key | Default | Extra          |
+--------------+-------------+------+-----+---------+----------------+
| author_id    | int(11)     | NO   | PRI | NULL    | auto_increment |
| author_last  | varchar(50) | YES  |     | NULL    |                |
| author_first | varchar(50) | YES  | MUL | NULL    |                |
| country      | varchar(50) | YES  |     | NULL    |                |
+--------------+-------------+------+-----+---------+----------------+
本文主要的所有操作都针对该表。
"""

def printAuthors(res,mode=0,lines=0):
    """
    格式化输出
    """
    print "*"*20, " lines: ",lines ," ","*"*20
    if mode==0  :
        for author_id , author_last , author_first , country in res :
            print "ID : %s , Author_last : %s , Author_First : %s , Country : %s" \
            % (author_id , author_last , author_first , country )
    else :
        for item in res :
            print "-----------"
            for key in item.keys():
                print key ," : ",item[key]


#建立连接
mysql = PyMysql.PyMysql()
mysql.newConnection(
        host="localhost",
        user="root",
        passwd="peterbbs",
        defaultdb="bookstore")
""
#定义sql语句
sqltext = "select * from authors order by author_id "
#调用query方法,得到result
lines , res = mysql.query(sqltext, mode=PyMysql.STORE_RESULT_MODE)
#提取数据
data = mysql.fetch_queryresult(res, maxrows=20, how=0, moreinfo=False)
#打印
printAuthors(data,0,lines)

#演示多行插入
sqltext = "insert into authors (author_last,author_first,country) values (%s,%s,%s)"
args = [('aaaaaa','bbbbbb','cccccc'),('dddddd','eeeeee','ffffff'),('gggggg','hhhhhh','iiiiii')]
lines ,cur = mysql.execute(sqltext,args,mode=PyMysql.DICTCURSOR_MODE,many=True)
print "*"*20, lines ,"行被插入 ","*"*20

sqltext = "select * from authors order by author_id "
#调用cursor.execute方法,得到result
lines ,cur = mysql.execute(sqltext,mode=PyMysql.DICTCURSOR_MODE)
#提取数据
data = mysql.fetch_executeresult(cur, mode=PyMysql.FETCH_MANY, rows=20)
#打印
printAuthors(data,1,lines)

#关闭连接
mysql.closeConnnection()

#+END_SRC

* 测试输出：
#+BEGIN_VERSE
    ******************** lines: 5 ********************

    ID : 1 , Author_last : Greene , Author_First : Graham , Country : United Kingdom
    ID : 4 , Author_last : Peter , Author_First : David , Country : China
    ID : 5 , Author_last : mayday , Author_First : Feng , Country : France
    ID : 6 , Author_last : zhang , Author_First : lixin , Country : France
    ID : 9 , Author_last : zhang111 , Author_First : lixin , Country : France
    ******************** 3 行被插入 ********************
    ******************** lines: 8 ********************
    -----------
    country : United Kingdom
    author_id : 1
    author_first : Graham
    author_last : Greene
    -----------
    country : China
    author_id : 4
    author_first : David
    author_last : Peter
    -----------
    country : France
    author_id : 5
    author_first : Feng
    author_last : mayday
    -----------
    country : France
    author_id : 6
    author_first : lixin
    author_last : zhang
    -----------
    country : France
    author_id : 9
    author_first : lixin
    author_last : zhang111
    -----------
    country : cccccc
    author_id : 53
    author_first : bbbbbb
    author_last : aaaaaa
    -----------
    country : ffffff
    author_id : 54
    author_first : eeeeee
    author_last : dddddd
    -----------
    country : iiiiii
    author_id : 55
    author_first : hhhhhh
    author_last : gggggg

#+END_VERSE
