wiki/2016-06-13-python-pymysql.html

<div id="outline-container-org0d80d30" class="outline-2">
<h2 id="org0d80d30">测试代码：</h2>
<div class="outline-text-2" id="text-org0d80d30">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">-*- encoding:utf-8 -*-</span>
<span style="font-weight: bold;">import</span> PyMysql

<span style="font-style: italic;">"""</span>
<span style="font-style: italic;">authors &#36825;&#24352;&#34920;&#24456;&#31616;&#21333;&#12290;</span>
<span style="font-style: italic;">+--------------+-------------+------+-----+---------+----------------+</span>
<span style="font-style: italic;">| Field        | Type        | Null | Key | Default | Extra          |</span>
<span style="font-style: italic;">+--------------+-------------+------+-----+---------+----------------+</span>
<span style="font-style: italic;">| author_id    | int(11)     | NO   | PRI | NULL    | auto_increment |</span>
<span style="font-style: italic;">| author_last  | varchar(50) | YES  |     | NULL    |                |</span>
<span style="font-style: italic;">| author_first | varchar(50) | YES  | MUL | NULL    |                |</span>
<span style="font-style: italic;">| country      | varchar(50) | YES  |     | NULL    |                |</span>
<span style="font-style: italic;">+--------------+-------------+------+-----+---------+----------------+</span>
<span style="font-style: italic;">&#26412;&#25991;&#20027;&#35201;&#30340;&#25152;&#26377;&#25805;&#20316;&#37117;&#38024;&#23545;&#35813;&#34920;&#12290;</span>
<span style="font-style: italic;">"""</span>

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">printAuthors</span>(res,mode=0,lines=0):
    <span style="font-style: italic;">"""</span>
<span style="font-style: italic;">    &#26684;&#24335;&#21270;&#36755;&#20986;</span>
<span style="font-style: italic;">    """</span>
    <span style="font-weight: bold;">print</span> <span style="font-style: italic;">"*"</span>*20, <span style="font-style: italic;">" lines: "</span>,lines ,<span style="font-style: italic;">" "</span>,<span style="font-style: italic;">"*"</span>*20
    <span style="font-weight: bold;">if</span> mode==0  :
        <span style="font-weight: bold;">for</span> author_id , author_last , author_first , country <span style="font-weight: bold;">in</span> res :
            <span style="font-weight: bold;">print</span> <span style="font-style: italic;">"ID : %s , Author_last : %s , Author_First : %s , Country : %s"</span> \
            % (author_id , author_last , author_first , country )
    <span style="font-weight: bold;">else</span> :
        <span style="font-weight: bold;">for</span> item <span style="font-weight: bold;">in</span> res :
            <span style="font-weight: bold;">print</span> <span style="font-style: italic;">"-----------"</span>
            <span style="font-weight: bold;">for</span> key <span style="font-weight: bold;">in</span> item.keys():
                <span style="font-weight: bold;">print</span> key ,<span style="font-style: italic;">" : "</span>,item[key]


<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">&#24314;&#31435;&#36830;&#25509;</span>
<span style="font-weight: bold; font-style: italic;">mysql</span> = PyMysql.PyMysql()
mysql.newConnection(
        host=<span style="font-style: italic;">"localhost"</span>,
        user=<span style="font-style: italic;">"root"</span>,
        passwd=<span style="font-style: italic;">"peterbbs"</span>,
        defaultdb=<span style="font-style: italic;">"bookstore"</span>)
<span style="font-style: italic;">""</span>
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">&#23450;&#20041;sql&#35821;&#21477;</span>
<span style="font-weight: bold; font-style: italic;">sqltext</span> = <span style="font-style: italic;">"select * from authors order by author_id "</span>
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">&#35843;&#29992;query&#26041;&#27861;,&#24471;&#21040;result</span>
<span style="font-weight: bold; font-style: italic;">lines</span> , <span style="font-weight: bold; font-style: italic;">res</span> = mysql.query(sqltext, mode=PyMysql.STORE_RESULT_MODE)
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">&#25552;&#21462;&#25968;&#25454;</span>
<span style="font-weight: bold; font-style: italic;">data</span> = mysql.fetch_queryresult(res, maxrows=20, how=0, moreinfo=<span style="font-weight: bold; text-decoration: underline;">False</span>)
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">&#25171;&#21360;</span>
printAuthors(data,0,lines)

<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">&#28436;&#31034;&#22810;&#34892;&#25554;&#20837;</span>
<span style="font-weight: bold; font-style: italic;">sqltext</span> = <span style="font-style: italic;">"insert into authors (author_last,author_first,country) values (%s,%s,%s)"</span>
<span style="font-weight: bold; font-style: italic;">args</span> = [(<span style="font-style: italic;">'aaaaaa'</span>,<span style="font-style: italic;">'bbbbbb'</span>,<span style="font-style: italic;">'cccccc'</span>),(<span style="font-style: italic;">'dddddd'</span>,<span style="font-style: italic;">'eeeeee'</span>,<span style="font-style: italic;">'ffffff'</span>),(<span style="font-style: italic;">'gggggg'</span>,<span style="font-style: italic;">'hhhhhh'</span>,<span style="font-style: italic;">'iiiiii'</span>)]
<span style="font-weight: bold; font-style: italic;">lines</span> ,<span style="font-weight: bold; font-style: italic;">cur</span> = mysql.execute(sqltext,args,mode=PyMysql.DICTCURSOR_MODE,many=<span style="font-weight: bold; text-decoration: underline;">True</span>)
<span style="font-weight: bold;">print</span> <span style="font-style: italic;">"*"</span>*20, lines ,<span style="font-style: italic;">"&#34892;&#34987;&#25554;&#20837; "</span>,<span style="font-style: italic;">"*"</span>*20

<span style="font-weight: bold; font-style: italic;">sqltext</span> = <span style="font-style: italic;">"select * from authors order by author_id "</span>
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">&#35843;&#29992;cursor.execute&#26041;&#27861;,&#24471;&#21040;result</span>
<span style="font-weight: bold; font-style: italic;">lines</span> ,<span style="font-weight: bold; font-style: italic;">cur</span> = mysql.execute(sqltext,mode=PyMysql.DICTCURSOR_MODE)
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">&#25552;&#21462;&#25968;&#25454;</span>
<span style="font-weight: bold; font-style: italic;">data</span> = mysql.fetch_executeresult(cur, mode=PyMysql.FETCH_MANY, rows=20)
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">&#25171;&#21360;</span>
printAuthors(data,1,lines)

<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">&#20851;&#38381;&#36830;&#25509;</span>
mysql.closeConnnection()

</pre>
</div>
</div>
</div>

<div id="outline-container-orgcc7c676" class="outline-2">
<h2 id="orgcc7c676">测试输出：</h2>
<div class="outline-text-2" id="text-orgcc7c676">
<p class="verse">
<b><b><b><b><b><b><b><b><b>**</b></b></b></b></b></b></b></b></b> lines: 5 <b><b><b><b><b><b><b><b><b>**</b></b></b></b></b></b></b></b></b><br>
<br>
ID : 1 , Author_last : Greene , Author_First : Graham , Country : United Kingdom<br>
ID : 4 , Author_last : Peter , Author_First : David , Country : China<br>
ID : 5 , Author_last : mayday , Author_First : Feng , Country : France<br>
ID : 6 , Author_last : zhang , Author_First : lixin , Country : France<br>
ID : 9 , Author_last : zhang111 , Author_First : lixin , Country : France<br>
<b><b><b><b><b><b><b><b><b>**</b></b></b></b></b></b></b></b></b> 3 行被插入 <b><b><b><b><b><b><b><b><b>**</b></b></b></b></b></b></b></b></b><br>
<b><b><b><b><b><b><b><b><b>**</b></b></b></b></b></b></b></b></b> lines: 8 <b><b><b><b><b><b><b><b><b>**</b></b></b></b></b></b></b></b></b><br>
-----------<br>
country : United Kingdom<br>
author_id : 1<br>
author_first : Graham<br>
author_last : Greene<br>
-----------<br>
country : China<br>
author_id : 4<br>
author_first : David<br>
author_last : Peter<br>
-----------<br>
country : France<br>
author_id : 5<br>
author_first : Feng<br>
author_last : mayday<br>
-----------<br>
country : France<br>
author_id : 6<br>
author_first : lixin<br>
author_last : zhang<br>
-----------<br>
country : France<br>
author_id : 9<br>
author_first : lixin<br>
author_last : zhang111<br>
-----------<br>
country : cccccc<br>
author_id : 53<br>
author_first : bbbbbb<br>
author_last : aaaaaa<br>
-----------<br>
country : ffffff<br>
author_id : 54<br>
author_first : eeeeee<br>
author_last : dddddd<br>
-----------<br>
country : iiiiii<br>
author_id : 55<br>
author_first : hhhhhh<br>
author_last : gggggg<br>
<br>
</p>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
